src/posts/Shell-Tricks.org
* Intro
  Here are some ways to speed up your shell use and make using a terminal more
  enjoyable. Depending on what you're working on, your mileage may vary, so
  change and adapt this stuff until you're comfortable.

  Usually when you open up a terminal, you're using [[https://www.gnu.org/software/bash/][Bash]], but you may also be
  using [[http://www.zsh.org/][Zsh]]. You can pick one or the other (see [[http://linuxcommand.org/man_pages/chsh1.html][chsh]] for more info). To figure
  out which one you're using, open up a terminal and run:
#+BEGIN_SRC sh
echo $SHELL
#+END_SRC
* Interactive stuff
** Vi mode or Readline?
   Interactive shells give you some tools to edit the current command you're
   entering, to search your command history, and do other useful stuff. By
   default if you're running Bash, you'll be using [[http://cnswww.cns.cwru.edu/php/chet/readline/rltop.html][GNU Readline]] (which defaults
   to [[https://www.gnu.org/software/emacs/][Emacs]]-like hotkeys).

   If you're using Zsh, you'll be using [[https://wiki.archlinux.org/index.php/Zsh#Key_bindings][something like readline]], which either
   defaults to emacs-like keyboard shortcuts, or [[https://en.wikipedia.org/wiki/Vi][vi]]-like shortcuts. This depends
   on whether you've specifically asked for one or the other (see [[http://zsh.sourceforge.net/Doc/Release/Zsh-Line-Editor.html#Zle-Builtins][bindkey]]), what
   =$EDITOR= is set to, and possibly other things.
*** Why is this important?
    It's more important to know that there are at least two different sets of
    keybindings, than to choose one. If you're used to [[http://www.vim.org/][Vim]], realize that vi-mode
    is missing some stuff you might have gotten used to (try [[http://vimdoc.sourceforge.net/htmldoc/motion.html#iw][ciw]] with your
    cursor in the middle of a word, or [[http://vimdoc.sourceforge.net/htmldoc/motion.html#aquote][ca"]] when inside double quotes).
** Readline
   The bash manual has a good reference for the [[http://www.gnu.org/software/bash/manual/bashref.html#Readline-Interaction][emacs-like keybindings]]. The ones
   I use most are:
   - =C-r= to search backwards through command history, keep pressing =C-r= to
     find the next item. (where =C= is the Control/Ctrl key)
   - =C-s= to search forwards through command history
   - =M-f= move forwards one word (where =M= is the Meta/Option/Alt key)
   - =M-b= move back one word
   - =C-k= delete text from the cursor to the end of the line
   - =C-/= undo the last action (just for editing text, not undoing commands;
     how cool would that be though?)
** Vi mode
   I had trouble finding an official list of keybindings for vi-mode, but [[http://hea-www.harvard.edu/~fine/Tech/vi.html][this
   list]] looks right, and I found a [[http://dougblack.io/words/zsh-vi-mode.html][blog post]] that talks about configuring vi
   mode in Zsh.

   When in vi mode you're either running commands (normal/command mode), or
   inserting text (insert mode). To show which mode you're in, check out [[http://unix.stackexchange.com/questions/547/make-my-zsh-prompt-show-mode-in-vi-mode#1019][this
   stackexchange answer]] for Zsh. It doesn't appear that you can tell which mode
   you're in when running bash, so try to remember which mode you're in, or just
   [[http://superuser.com/questions/18583/how-to-show-the-current-vi-mode-when-using-vi-keybindings-in-the-shell#21510][press escape a lot]].
** Job Control
   Running commands in your shell are sometimes referred to as "jobs", sometimes
   they take over the shell (like when you're running vim or emacs). Here are
   some useful things you can do to running commands:
   - Stop a running command (including editors) with =C-z=
   - See which commands are running with the =jobs= command
   - Bring a job to the foreground with the =fg= command
   - Bring a specific command (as seen in the output of =jobs=) to the
     foreground with =fg %1= where 1 is the id of the command

   Suspending programs and running others can be useful when some of your
   workflow requires an interactive program (like an editor), but you need a
   quick shell here and there (like when you're running recently-edited test
   code). To me, this feels faster than switching terminals or using something
   like [[http://tmux.sourceforge.net/][tmux]]. For more info about job control, see [[https://www.gnu.org/software/bash/manual/bashref.html#Job-Control][the bash manual]].
*** Aliases for quick job control
#+BEGIN_SRC sh
alias f=fg # foreground the command that was last suspended
alias j=jobs # show the list of background jobs
alias f1='fg %1' # bring the first suspended job to the foreground
alias f2='fg %2' # note: this isn't a function key,
alias f3='fg %3' # but the letter 'f' followed by the number '1'
alias f4='fg %4'
alias f5='fg %5'
#+END_SRC
