posts/Shell-Tricks.html
<!doctype html>
<html lang=en>
<head>
  <title>Josh's Blog</title>
  <meta charset=utf-8>
  <meta name=viewport content='initial-scale=1'>
  <link href=/css/style.css rel=stylesheet>
</head>
<body class=light>
   <a href=javascript:void(0)
     id=menu-toggle
     class=menu-item
     title='toggle the menu'>
    ☰
   </a>

  <a href=javascript:void(0)
    id=theme-toggle
    class=menu-item
    title='toggle light/dark themes'>
    ☼☽
  </a>

  <a href=javascript:void(0)
    id=download-links-toggle
    class=menu-item
    title='toggle download links'>
    ↓
  </a>

  <a href=/
    id=return-to-home
    class=menu-item
    title='back to the list of posts'
    rel=contents>
    ←
  </a>

  <article id=content>
<h1>Shell Tricks</h1><a href='/posts/Shell-Tricks.pdf' target=_blank class='post-download-link post-pdf-link' title='download as pdf'> pdf </a><a href='/posts/Shell-Tricks.txt' target=_blank class='post-download-link post-source-link' title='download as text'> text </a><a href='/src/posts/Shell-Tricks.org' target=_blank class='post-download-link post-source-link' title='download as org-mode text'> source </a><p>
Here are some ways to speed up your shell use and make using a terminal more
enjoyable. Depending on what you're working on, your mileage may vary, so change
and adapt this stuff until you're comfortable.
</p>

<p>
Usually when you open up a terminal, you're using <a href="https://www.gnu.org/software/bash/">Bash</a>, but you may also be
using <a href="http://www.zsh.org/">Zsh</a>. You can pick one or the other (see <a href="http://linuxcommand.org/man_pages/chsh1.html">chsh</a> for more info). To figure out
which one you're using, open up a terminal and run:
</p>
<div class="org-src-container">



<div class="highlight"><pre><span class="nb">echo</span> <span class="nv">$SHELL</span></pre></div>


</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Interactive stuff <a href=#sec-1 class=anchor-link title="Link to this section">⚓</a></h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
  <h3 id="sec-1-1">Vi mode or Readline? <a href=#sec-1-1 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Interactive shells give you some tools to edit the current command you're
entering, to search your command history, and do other useful stuff. By
default if you're running Bash, you'll be using <a href="http://cnswww.cns.cwru.edu/php/chet/readline/rltop.html">GNU Readline</a> (which defaults
to <a href="https://www.gnu.org/software/emacs/">Emacs</a>-like hotkeys).
</p>

<p>
If you're using Zsh, you'll be using <a href="https://wiki.archlinux.org/index.php/Zsh#Key_bindings">something like readline</a>, which either
defaults to emacs-like keyboard shortcuts, or <a href="https://en.wikipedia.org/wiki/Vi">vi</a>-like shortcuts. This depends
on whether you've specifically asked for one or the other (see <a href="http://zsh.sourceforge.net/Doc/Release/Zsh-Line-Editor.html#Zle-Builtins">bindkey</a>), what
<code>$EDITOR</code> is set to, and possibly other things.
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
  <h4 id="sec-1-1-1">Why is this important? <a href=#sec-1-1-1 class=anchor-link title="Link to this section">⚓</a></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
It's more important to know that there are at least two different sets of
keybindings, than to choose one. If you're used to <a href="http://www.vim.org/">Vim</a>, realize that vi-mode
is missing some stuff you might have gotten used to (try <a href="http://vimdoc.sourceforge.net/htmldoc/motion.html#iw">ciw</a> with your
cursor in the middle of a word, or <a href="http://vimdoc.sourceforge.net/htmldoc/motion.html#aquote">ca"</a> when inside double quotes).
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
  <h3 id="sec-1-2">Readline <a href=#sec-1-2 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-1-2">
<p>
The bash manual has a good reference for the <a href="http://www.gnu.org/software/bash/manual/bashref.html#Readline-Interaction">emacs-like keybindings</a>. The ones
I use most are:
</p>
<ul class="org-ul">
<li><code>C-r</code> to search backwards through command history, keep pressing <code>C-r</code> to
find the next item. (where <code>C</code> is the Control/Ctrl key)
</li>
<li><code>C-s</code> to search forwards through command history
</li>
<li><code>M-f</code> move forwards one word (where <code>M</code> is the Meta/Option/Alt key)
</li>
<li><code>M-b</code> move back one word
</li>
<li><code>C-k</code> delete text from the cursor to the end of the line
</li>
<li><code>C-/</code> undo the last action (just for editing text, not undoing commands;
how cool would that be though?)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
  <h3 id="sec-1-3">Vi mode <a href=#sec-1-3 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-1-3">
<p>
I had trouble finding an official list of keybindings for vi-mode, but <a href="http://hea-www.harvard.edu/~fine/Tech/vi.html">this
list</a> looks right, and I found a <a href="http://dougblack.io/words/zsh-vi-mode.html">blog post</a> that talks about configuring vi
mode in Zsh.
</p>

<p>
When in vi mode you're either running commands (normal/command mode), or
inserting text (insert mode). To show which mode you're in, check out <a href="http://unix.stackexchange.com/questions/547/make-my-zsh-prompt-show-mode-in-vi-mode#1019">this
stackexchange answer</a> for Zsh. It doesn't appear that you can tell which mode
you're in when running bash, so try to remember which mode you're in, or just
<a href="http://superuser.com/questions/18583/how-to-show-the-current-vi-mode-when-using-vi-keybindings-in-the-shell#21510">press escape a lot</a>.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
  <h3 id="sec-1-4">Job Control <a href=#sec-1-4 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-1-4">
<p>
Running commands in your shell are sometimes referred to as "jobs", sometimes
they take over the shell (like when you're running vim or emacs). Here are
some useful things you can do to running commands:
</p>
<ul class="org-ul">
<li>Stop a running command (including editors) with <code>C-z</code>
</li>
<li>See which commands are running with the <code>jobs</code> command
</li>
<li>Bring a job to the foreground with the <code>fg</code> command
</li>
<li>Bring a specific command (as seen in the output of <code>jobs</code>) to the
foreground with <code>fg %1</code> where 1 is the id of the command
</li>
</ul>

<p>
Suspending programs and running others can be useful when some of your
workflow requires an interactive program (like an editor), but you need a
quick shell here and there (like when you're running recently-edited test
code). To me, this feels faster than switching terminals or using something
like <a href="http://tmux.sourceforge.net/">tmux</a>. For more info about job control, see <a href="https://www.gnu.org/software/bash/manual/bashref.html#Job-Control">the bash manual</a>.
</p>
</div>
<div id="outline-container-sec-1-4-1" class="outline-4">
  <h4 id="sec-1-4-1">Aliases for quick job control <a href=#sec-1-4-1 class=anchor-link title="Link to this section">⚓</a></h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">



<div class="highlight"><pre><span class="nb">alias </span><span class="nv">f</span><span class="o">=</span><span class="nb">fg</span> <span class="c"># foreground the command that was last suspended</span>
<span class="nb">alias </span><span class="nv">j</span><span class="o">=</span><span class="nb">jobs</span> <span class="c"># show the list of background jobs</span>
<span class="nb">alias </span><span class="nv">f1</span><span class="o">=</span><span class="s1">&#39;fg %1&#39;</span> <span class="c"># bring the first suspended job to the foreground</span>
<span class="nb">alias </span><span class="nv">f2</span><span class="o">=</span><span class="s1">&#39;fg %2&#39;</span> <span class="c"># note: this isn&#39;t a function key,</span>
<span class="nb">alias </span><span class="nv">f3</span><span class="o">=</span><span class="s1">&#39;fg %3&#39;</span> <span class="c"># but the letter &#39;f&#39; followed by the number &#39;1&#39;</span>
<span class="nb">alias </span><span class="nv">f4</span><span class="o">=</span><span class="s1">&#39;fg %4&#39;</span>
<span class="nb">alias </span><span class="nv">f5</span><span class="o">=</span><span class="s1">&#39;fg %5&#39;</span></pre></div>


</div>
</div>
</div>
</div>
