src/posts/Shell-Tricks.org
** Scripts aren't run "interactively"
   When you run a script that you saved to a file, usually all the fancy aliases
   and other things that you use when typing in your shell aren't available,
   because they're not needed. The bash manual has a good explanation of
   [[http://www.gnu.org/software/bash/manual/bashref.html#Interactive-Shells][interactive shells]].

   Whether your shell is interactive affects:
   - which files are loaded when the shell starts (see the [[http://www.gnu.org/software/bash/manual/bashref.html#Bash-Startup-Files][bash manual]] or the
     [[http://zsh.sourceforge.net/Doc/Release/Files.html#Startup_002fShutdown-Files][zsh manual]])
     - this means your aliases usually won't be loaded when scripting, which is
       a good things (your scripts will be more portable), but can be confusing
       when you're running a shell from another program like [[http://vimdoc.sourceforge.net/htmldoc/various.html#:!][=:!= command in vi]].
   - [[https://www.gnu.org/software/bash/manual/bashref.html#Interactive-Shell-Behavior][other things]], like [[https://www.gnu.org/software/bash/manual/bashref.html#Job-Control][job control]]
* Switch between directories
  You might find that you spend a lot of time switching directories. Here are a
  few things you can use to speed this up:
#+BEGIN_SRC sh
cd - # the last directory you were in
cd # the home directory, same as `cd ~` or `cd $HOME`
#+END_SRC
** Useful aliases for moving up directories
#+BEGIN_SRC sh
alias ..='cd ..' # move up one directory
alias ..2='cd ../..' # move up two directories
alias ..3='cd ../../..'
alias ..4='cd ../../../..'
#+END_SRC
** Switching between projects
   It's also good to keep things organized. Personally I keep my code/work in
   =~/projects=, which (with a [[https://github.com/losingkeys/dotfiles/blob/707ded233a202ee4849491c00b553e33b9c88bbd/.zshrc#L63-L69][simple shell function]] and [[http://zsh.sourceforge.net/Doc/Release/Completion-System.html][Zsh's =compdef= for
   completion magic]]) makes it really easy to switch to different projects, or
   get back to a project's root directory. =p <project>= will bring you to a
   specific project's folder. This is a bit nicer than =cd= because it doesn't
   matter what directory you're in, =p= will always switch you back to
   =~/projects= (when given no arguments), or =~/projects/something= if you type
   =p something=.
* Run previously ran commands
#+BEGIN_SRC sh
!! # the last command

sudo !! # the last command, but with an added prefix

!-2 # the second to last command, for instance:
touch something/file
#=> touch: cannot touch ‘something/file’: No such file or directory
mkdir something
!-2 # runs `touch something/file`

!1234 # the '1234'th history item, use `history` to see them all
#+END_SRC
  I just learned these are called "event designators", for more info, see [[http://www.gnu.org/software/bash/manual/bashref.html#Event-Designators][the
  bash manual]].
* One-character aliases
  You might notice that you run certain commands very often. Why not make these
  as short as possible by aliasing them to a single letter? Here are mine so
  far:
#+BEGIN_SRC sh
alias e='TERM=xterm-16color emacs -nw' # edit text/code with emacs
alias v=vim # edit text/code with vim
alias m=mutt # read mail

alias g=git # manage changes to files (http://git-scm.com/)

alias f=fg # bring a background job to the foreground
alias j=jobs # list background jobs

alias l=ls # list files

# start or join a tmux session:
alias t='tmux attach || tmux new -s "$(basename $PWD | sed "s/\W/-/g")"'

# update an Arch Linux system:
alias u="su -c 'pacman --sync --refresh --sysupgrade'"
# update an OS X system:
alias u='sudo softwareupdate --download --install --all && brew update && brew upgrade'
#+END_SRC
* Adding, editing, and pruning aliases
  Even though I [[https://en.wikipedia.org/wiki/Pair_programming][pair program]] at work, I still make [[https://github.com/losingkeys/dotfiles/blob/707ded233a202ee4849491c00b553e33b9c88bbd/.shell-helpers/aliases][plenty of aliases]]. Some
  people avoid aliases all together because they pair. It's frustrating to type
  in a command you're used to working and get a "command not found" error, or
  worse: get some behavior you didn't expect (I've heard of people aliasing =git
  co= to =git commit=, where some of us would expect it to run =git checkout=).
  Here are some things to keep in mind when making aliases:
** Am I overriding something the system provides?
   See if the command already exists before aliasing it. You can do this in a
   number of ways:
   - Running the command (possibly dangerous). If you get an "=ab=: command not
     found" or similar error, you're probably clear to alias it away.
   - Search your distribution's [[https://www.archlinux.org/packages/][package archives]]. You can usually do this with
     your OS's [[https://www.archlinux.org/pacman/][package manager]] right from the terminal
     - You may be able to search for existing binaries/commands using something
       like [[https://www.archlinux.org/packages/extra/x86_64/pkgfile/][pkgfile]]
** Is what I'm about to alias destructive in any way? Can it's effects be reversed?
   Be aware that making destructive commands easier to type means you'll be
   typing them faster, maybe even without thinking. If you were to accidentally
   run whatever it is you're about to alias (for instance you might alias =rm
   -f= to =r= to avoid typing the flag all the time), can you reverse whatever
   it did? How hard would that be?  Sometimes it might be worth leaving certain
   commands more tedious so you don't lose work. Also some commands can be made
   safer with options. You could alias =rm= to =rm -i= or =rm -I= to make it ask
   for confirmation when deleting files.
