posts/Shell-Tricks.html
<div id="outline-container-sec-1-5" class="outline-3">
  <h3 id="sec-1-5">Scripts aren't run "interactively" <a href=#sec-1-5 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-1-5">
<p>
When you run a script that you saved to a file, usually all the fancy aliases
and other things that you use when typing in your shell aren't available,
because they're not needed. The bash manual has a good explanation of
<a href="http://www.gnu.org/software/bash/manual/bashref.html#Interactive-Shells">interactive shells</a>.
</p>

<p>
Whether your shell is interactive affects:
</p>
<ul class="org-ul">
<li>which files are loaded when the shell starts (see the <a href="http://www.gnu.org/software/bash/manual/bashref.html#Bash-Startup-Files">bash manual</a> or the
<a href="http://zsh.sourceforge.net/Doc/Release/Files.html#Startup_002fShutdown-Files">zsh manual</a>)
<ul class="org-ul">
<li>this means your aliases usually won't be loaded when scripting, which is
a good things (your scripts will be more portable), but can be confusing
when you're running a shell from another program like <a href="http://vimdoc.sourceforge.net/htmldoc/various.html#:!"><code>:!</code> command in vi</a>.
</li>
</ul>
</li>
<li><a href="https://www.gnu.org/software/bash/manual/bashref.html#Interactive-Shell-Behavior">other things</a>, like <a href="https://www.gnu.org/software/bash/manual/bashref.html#Job-Control">job control</a>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
  <h2 id="sec-2">Switch between directories <a href=#sec-2 class=anchor-link title="Link to this section">⚓</a></h2>
<div class="outline-text-2" id="text-2">
<p>
You might find that you spend a lot of time switching directories. Here are a
few things you can use to speed this up:
</p>
<div class="org-src-container">



<div class="highlight"><pre><span class="nb">cd</span> - <span class="c"># the last directory you were in</span>
<span class="nb">cd</span> <span class="c"># the home directory, same as `cd ~` or `cd $HOME`</span></pre></div>


</div>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
  <h3 id="sec-2-1">Useful aliases for moving up directories <a href=#sec-2-1 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">



<div class="highlight"><pre><span class="nb">alias</span> ..<span class="o">=</span><span class="s1">&#39;cd ..&#39;</span> <span class="c"># move up one directory</span>
<span class="nb">alias</span> ..2<span class="o">=</span><span class="s1">&#39;cd ../..&#39;</span> <span class="c"># move up two directories</span>
<span class="nb">alias</span> ..3<span class="o">=</span><span class="s1">&#39;cd ../../..&#39;</span>
<span class="nb">alias</span> ..4<span class="o">=</span><span class="s1">&#39;cd ../../../..&#39;</span></pre></div>


</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
  <h3 id="sec-2-2">Switching between projects <a href=#sec-2-2 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-2-2">
<p>
It's also good to keep things organized. Personally I keep my code/work in
<code>~/projects</code>, which (with a <a href="https://github.com/losingkeys/dotfiles/blob/707ded233a202ee4849491c00b553e33b9c88bbd/.zshrc#L63-L69">simple shell function</a> and <a href="http://zsh.sourceforge.net/Doc/Release/Completion-System.html">Zsh's <code>compdef</code> for
completion magic</a>) makes it really easy to switch to different projects, or
get back to a project's root directory. <code>p &lt;project&gt;</code> will bring you to a
specific project's folder. This is a bit nicer than <code>cd</code> because it doesn't
matter what directory you're in, <code>p</code> will always switch you back to
<code>~/projects</code> (when given no arguments), or <code>~/projects/something</code> if you type
<code>p something</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
  <h2 id="sec-3">Run previously ran commands <a href=#sec-3 class=anchor-link title="Link to this section">⚓</a></h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">



<div class="highlight"><pre>!! <span class="c"># the last command</span>

sudo !! <span class="c"># the last command, but with an added prefix</span>

!-2 <span class="c"># the second to last command, for instance:</span>
touch something/file
<span class="c">#=&gt; touch: cannot touch ‘something/file’: No such file or directory</span>
mkdir something
!-2 <span class="c"># runs `touch something/file`</span>

!1234 <span class="c"># the &#39;1234&#39;th history item, use `history` to see them all</span></pre></div>


</div>
<p>
I just learned these are called "event designators", for more info, see <a href="http://www.gnu.org/software/bash/manual/bashref.html#Event-Designators">the
bash manual</a>.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
  <h2 id="sec-4">One-character aliases <a href=#sec-4 class=anchor-link title="Link to this section">⚓</a></h2>
<div class="outline-text-2" id="text-4">
<p>
You might notice that you run certain commands very often. Why not make these
as short as possible by aliasing them to a single letter? Here are mine so
far:
</p>
<div class="org-src-container">



<div class="highlight"><pre><span class="nb">alias </span><span class="nv">e</span><span class="o">=</span><span class="s1">&#39;TERM=xterm-16color emacs -nw&#39;</span> <span class="c"># edit text/code with emacs</span>
<span class="nb">alias </span><span class="nv">v</span><span class="o">=</span>vim <span class="c"># edit text/code with vim</span>
<span class="nb">alias </span><span class="nv">m</span><span class="o">=</span>mutt <span class="c"># read mail</span>

<span class="nb">alias </span><span class="nv">g</span><span class="o">=</span>git <span class="c"># manage changes to files (http://git-scm.com/)</span>

<span class="nb">alias </span><span class="nv">f</span><span class="o">=</span><span class="nb">fg</span> <span class="c"># bring a background job to the foreground</span>
<span class="nb">alias </span><span class="nv">j</span><span class="o">=</span><span class="nb">jobs</span> <span class="c"># list background jobs</span>

<span class="nb">alias </span><span class="nv">l</span><span class="o">=</span>ls <span class="c"># list files</span>

<span class="c"># start or join a tmux session:</span>
<span class="nb">alias </span><span class="nv">t</span><span class="o">=</span><span class="s1">&#39;tmux attach || tmux new -s &quot;$(basename $PWD | sed &quot;s/\W/-/g&quot;)&quot;&#39;</span>

<span class="c"># update an Arch Linux system:</span>
<span class="nb">alias </span><span class="nv">u</span><span class="o">=</span><span class="s2">&quot;su -c &#39;pacman --sync --refresh --sysupgrade&#39;&quot;</span>
<span class="c"># update an OS X system:</span>
<span class="nb">alias </span><span class="nv">u</span><span class="o">=</span><span class="s1">&#39;sudo softwareupdate --download --install --all &amp;&amp; brew update &amp;&amp; brew upgrade&#39;</span></pre></div>


</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
  <h2 id="sec-5">Adding, editing, and pruning aliases <a href=#sec-5 class=anchor-link title="Link to this section">⚓</a></h2>
<div class="outline-text-2" id="text-5">
<p>
Even though I <a href="https://en.wikipedia.org/wiki/Pair_programming">pair program</a> at work, I still make <a href="https://github.com/losingkeys/dotfiles/blob/707ded233a202ee4849491c00b553e33b9c88bbd/.shell-helpers/aliases">plenty of aliases</a>. Some
people avoid aliases all together because they pair. It's frustrating to type
in a command you're used to working and get a "command not found" error, or
worse: get some behavior you didn't expect (I've heard of people aliasing <code>git
  co</code> to <code>git commit</code>, where some of us would expect it to run <code>git checkout</code>).
Here are some things to keep in mind when making aliases:
</p>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
  <h3 id="sec-5-1">Am I overriding something the system provides? <a href=#sec-5-1 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-5-1">
<p>
See if the command already exists before aliasing it. You can do this in a
number of ways:
</p>
<ul class="org-ul">
<li>Running the command (possibly dangerous). If you get an "<code>ab</code>: command not
found" or similar error, you're probably clear to alias it away.
</li>
<li>Search your distribution's <a href="https://www.archlinux.org/packages/">package archives</a>. You can usually do this with
your OS's <a href="https://www.archlinux.org/pacman/">package manager</a> right from the terminal
<ul class="org-ul">
<li>You may be able to search for existing binaries/commands using something
like <a href="https://www.archlinux.org/packages/extra/x86_64/pkgfile/">pkgfile</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
  <h3 id="sec-5-2">Is what I'm about to alias destructive in any way? Can its effects be reversed? <a href=#sec-5-2 class=anchor-link title="Link to this section">⚓</a></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Be aware that making destructive commands easier to type means you'll be
typing them faster, maybe even without thinking. If you were to accidentally
run whatever it is you're about to alias (for instance you might alias <code>rm
   -f</code> to <code>r</code> to avoid typing the flag all the time), can you reverse whatever
it did? How hard would that be?  Sometimes it might be worth leaving certain
commands more tedious so you don't lose work. Also some commands can be made
safer with options. You could alias <code>rm</code> to <code>rm -i</code> or <code>rm -I</code> to make it ask
for confirmation when deleting files.
</p>
</div>
</div>
